package adapter;

/**
 * Ціль: Перетворення интерфейса одного класу в інтерфейс того класу, який потрібен клієнту
 *
 * Для чого використовується: Для забезпечення спільної робоит класів, інтерфейси яких не сумусні
 *
 * Приклади використання:
 *
 * -інтерфейс класу, який ми хочемо використовувати, не відповідає нашим потребам
 * -необхідно мати клас, який повинен взаємодіяти з класами, які йому невідомі або не зв'язані з ним
 * -необхідно використовувати кілька інсуючих підкласів, але краще використовувати методи цих класів
 * створюючи їх нові підкласи
 */

public class AdapterTest {
    public static void main(String[] args) {
//        Database database = null;

        Database database = new AdapterJavaToDatabase();

        database.insert();
        database.update();
        database.select();
        database.remove();
    }
}
