package bridge.firstImpl;

/**
 * Ціль: Відділити абстрацію від її реалізації таким чином, щоб чи могли змінювати їх незалежно одне від одного
 *
 * Для чого використовується: Для отримання переваг наслідування без втрати гнучкості
 *
 * Приклади використання:
 * -запобігання жорсткої прив'язки абстракції до реалізації (жорстка прив'язка відбуваться при наслідування)
 * - в майбутньому ми хочемо разширяти за допомогою підкласів і реалізацію, і абстракцію
 * - якщо зміни в реалізації не повинні відображатися на клієнтах абстракції
 * - для розподілення однієї реалізації між кількома об'єктами и не показувати цього клієнту
 */

public class BridgeTest {
    public static void main(String[] args) {
        Program [] programs = {
                new BankSystem(new JavaDeveloper()),
                new StockExchange(new CppDeveloper())
        };

        for(Program program: programs) {
            program.developProgram();
        }
    }
}
